export default {
    "data": {
        "type": "短期作业",
        "cd_type": "超车道",
        "dl": [{
            "id": 1,//道路ID
            "name": "高速道路1",//道路名字
            "type": "1",//上下行
            "path": "./models/dl/高速公路场景封闭超车.glb",//道路模型的地址
            "bs": [{
                    "id": 1,//标识ID
                    "name": "001",//标识名称
                    "bsid": 1,//标识类别的ID
                    "s": 90,//旋转
                    "x": "100",//距离X
                    "y": "150"//距离Y
                },
                {
                    "id": 2,
                    "name": "002",
                    "bsid": 2,
                    "s": 90,
                    "x": "100",
                    "y": "200"
                },
                {
                    "id": 3,
                    "name": "003",
                    "bsid": 2,
                    "s": 90,
                    "x": "100",
                    "y": "250"
                }
            ]
        }]
    }
}