export default {
    "data": {
        "job_type": 1, // 作业类型：1 短期作业 2 长期作业 3 临时作业 4 移动作业
        "road_type": 1, // 道路类型：1 行车道 2 超车道
        "u_d_type": 1, // 上下行类型：1 上行 2 下行
        "dl": [{
                "id": 1, //道路ID
                "name": "高速道路1", //道路名字
                "type": 1, // 类型：1 道路模型 2 标识模型
                "path": "./models/dl/高速公路场景封闭超车.glb",//道路模型的地址
                "bs": [
                    {
                        "id": 1, //标识ID
                        "name": "001", //标识名称
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 1, // 标识模型的 ID
                        "s": 180, //旋转
                        "x": 300, //距离X
                        "y": 1000, //距离Y
                        "sf": 1 //缩放系数
                    },
                    {
                        "id": 2,
                        "name": "002",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 2, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 1200,
                        "sf": 1
                    },
                    {
                        "id": 3, //标识ID
                        "name": "003", //标识名称
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 3, // 标识模型的 ID
                        "s": 180, //旋转
                        "x": 300, //距离X
                        "y": 2000, //距离Y
                        "sf": 1 //缩放系数
                    },
                    {
                        "id": 4,
                        "name": "004",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 2, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 2400,
                        "sf": 1
                    },
                    {
                        "id": 5, //标识ID
                        "name": "005", //标识名称
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 4, // 标识模型的 ID
                        "s": 180, //旋转
                        "x": 300, //距离X
                        "y": 3000, //距离Y
                        "sf": 1 //缩放系数
                    },
                    {
                        "id": 6,
                        "name": "006",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 5, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 3600,
                        "sf": 1
                    },
                    {
                        "id": 7,
                        "name": "007",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 6, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 4000,
                        "sf": 1
                    },
                    {
                        "id": 8,
                        "name": "008",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 7, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 4800,
                        "sf": 1
                    },
                    {
                        "id": 9,
                        "name": "009",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 8, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 5000,
                        "sf": 1
                    },
                    {
                        "id": 10,
                        "name": "010",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 9, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 6000,
                        "sf": 1
                    },
                    {
                        "id":11,
                        "name": "011",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 10, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 6000,
                        "sf": 1
                    },
                    {
                        "id": 12,
                        "name": "012",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 11, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 7200,
                        "sf": 1
                    },
                    {
                        "id":13,
                        "name": "013",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 1, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 7000,
                        "sf": 1
                    },
                    {
                        "id": 14,
                        "name": "014",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 2, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 8400,
                        "sf": 1
                    },
                    {
                        "id":15,
                        "name": "015",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 3, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 10000,
                        "sf": 1
                    },
                    {
                        "id": 16,
                        "name": "016",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 4, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 9600,
                        "sf": 1
                    },
                    {
                        "id":17,
                        "name": "017",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 5, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 11000,
                        "sf": 1
                    },
                    {
                        "id": 18,
                        "name": "018",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 6, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 10800,
                        "sf": 1
                    },
                    {
                        "id":19,
                        "name": "019",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 7, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 12000,
                        "sf": 1
                    },
                    {
                        "id": 20,
                        "name": "020",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 8, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 12000,
                        "sf": 1
                    },
                    {
                        "id":21,
                        "name": "021",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 9, // 标识模型的 ID
                        "s": 180,
                        "x": 300,
                        "y": 13000,
                        "sf": 1
                    },
                    {
                        "id": 22,
                        "name": "022",
                        "type": 2, // 类型：1 道路模型 2 标识模型
                        "d_model_id": 10, // 标识模型的 ID
                        "s": 0,
                        "x": -300,
                        "y": 14200,
                        "sf": 1
                    }
                ]
            },
            {
                "id": 2, //道路ID
                "name": "高速道路2", //道路名字
                "type": 1, // 类型：1 道路模型 2 标识模型
                "path": "./models/dl/路面模版.glb",//道路模型的地址
                "bs": []
            }
            // {
            //     "id": 2, //道路ID
            //     "name": "高速道路2", //道路名字
            //     "type": 1, // 类型：1 道路模型 2 标识模型
            //     "path": "http://wwww.aaa.bbb.ccc/dl_2_.gltf", //道路模型的地址
            //     "bs": []
            // }
        ]
    }
}